Revit 2027 API
OverridePermissions Enumeration
 Types of overrides that can be applied to a category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum OverridePermissions
Public Enumeration OverridePermissions
public enum class OverridePermissions
type OverridePermissions
Members
Member name | Value | Description
CutFills | 4 |  Cut fills
CutLines | 3 |  Cut lines
Halftone | 2 |  Halftone
ProjectionFills | 6 |  Projection fills
ProjectionLines | 5 |  Projection lines
Surfaces | 7 |  Surface transparency
ViewDetailLevel | 1 |  View detail level
See Also
Reference
Autodesk.Revit.DB Namespace